content/posts/2021-book-review-accelerate-the-science-of-lean-software-and-devops.md
+++
title = "Book review: Accelerate - The science of Lean software and DevOps"
author = ["Victor Dorneanu"]
date = 2021-11-24T20:24:00+01:00
lastmod = 2022-01-06T11:03:11+01:00
tags = ["books", "devops", "architecture"]
draft = false
+++

I always use to say: "_Software currently rules the world._" Almost every aspect in our
(digital) life has to do with software: The apps you use on your smartphone, the
mail/hosting services you rely on, online shopping, train tickets, in general everything
that somehow adds value to your life. Competition among organizations is driven by speed,
the ability to deliver new features to the customers, stable products, security within
their eco-systems and many other aspects. And what do they have in common? If you ask me:
**Software**.


## Key takeaways {#key-takeaways}

-   Software delivery performance is vital for business since it impacts the speed and velocity you deliver value to your customers
-   There are 24 practices that can have an influence on your software delivery and these are categorized into 5 categories
-   It takes technical but also organizational changes to create high-performing teams
-   Strong leadership but also agile practices like Lean, Scrum, Kanban will help you to focus on your customer needs, implement requested features and adapt if needed
-   Continuous Delivery (CD) plays a vital role and is driven by a DevOps oriented mindset


## Introduction {#introduction}

Usually I don't do book reviews. I just tend to collect my notes and thoughts in my
[Zettelkasten](https://brainfck.org). But this time I wanted to share some insights, write them down and convince
you why you should read this book. [Accelerate](https://brainfck.org/#Accelerate) is not about **software
engineering** nor entirely about **DevOps**. It does have something to do with the [Agile
manifesto](https://agilemanifesto.org/) but from a more data-driven, scientific point of view. To be more precise, the
authors **analyzed** over many years factors that enabled teams to deliver software (features)
in short cycles while still limiting technical debt and having a stable and secure
deployment process.


### Big picture {#big-picture}

If you want to skip the details, just have a look at this diagram and try to understand how software delivery is impacted by different areas.

{{< gbox src="/posts/img/2021/accelerate-big-picture.png" title="Accelerate Big Picture" caption="Which factors lead to software deliver improvement? There are different factors that are somehow inter-dependent" pos="left" >}}


## Speed {#speed}

Why is speed so important? Because it does make a difference how fast you can "conquer" a market and
deliver value to your customers. Or as the authors put it:

> Business as usual is no longer enough to remain competitive. Organizations in all
> industries, from finance and banking to retail, telecommunications, and even government,
> are turning away from delivering new products and services using big projects with long
> lead times. Instead, they are using small teams that work in short cycles and measure
> feedback from users to build products and services that delight their customers and
> rapidly deliver value to their organizations. These high performers are working
> incessantly to get better at what they do, letting no obstacles stand in their path, even
> in the face of high levels of risk and uncertainty about how they may achieve their goals.
>
> At the heart of this acceleration is software.
>
> -- [Accelerate](https://brainfck.org/#Accelerate)


## Software delivery performance {#software-delivery-performance}

Research presented in the book has found **24** key capababilities that seem to drive **software
development performance**. If you are a **high-performer** or a **low-performer** merely depends on
the capabilities you, your team and your organization focus on. The authors have defined 5
categories for these capabilities:

-   **Continuous Delivery (CD)**
-   **Architecture**
    -   architectural characteristics
-   **Product and process**
-   **Lean Management and Monitoring**
-   **Culture**

Before we go into deep discussion, let me try to summarize why **capabilities** matter more than **maturity**.


## Capabilities vs Maturity {#capabilities-vs-maturity}

Lots of **mature** organizations think they own a quite big piece of cake when it comes to
market share. While relying on that, they tend to become less innovative, have complicated
internal processes (slows down the overall development process), lose talented
high-performers (who wants to work in a slow, process-heavy environment?). Instead they
should focus on certain capabilities in order to **drive continuously improvement**.

Once organizations arrive at a mature state, they see their journey as accomplished and
declare themselves done. However, this way they don't adapt to technological changes and
those within the business landscape. High-performing organizations are **always striving to
be better** and never consider themselves as done or mature.

> Technology leaders need to deliver software quickly and reliably to win in the market. For
> many companies, this requires significant changes to the way we deliver software. The key
> to successful change is measuring and understanding the right things with a focus on
> capabilities—not on maturity.
>
> -- [Accelerate](https://brainfck.org/#Accelerate)

Mature organizations not only have a bad time to keep up with new technologies but they
also **prescribe the same set of technologies** for every set of teams in order to progress.
The better approach would be to take into consideration current context, used systems,
goals and constraints and focus on the capabilities that will give the teams the most
benefit. This way different parts of the organization are allowed to take a customized
approach to improvement.

**Maturity models** also tend to define a static level of technological, procedural and
organizational abilities to be achieved. What is good enough and high-performing today,
might no longer be good enough next year.


## Measuring performance {#measuring-performance}

Most organizations focus on "old-school" technical measures like lines of code, velocity
which measure some performance locally (in general within a limited scope) rather than on
a more global one. Developers (and DevSecOps folks as well) are supposed to **solve business
problems** and therefore focus on a **global outcome** and not output. It doesn't matter how
many lines of code your team has, how often you deploy, how many Security tools you have
implemented within your CI/CD pipeline. If it doesn't help to achieve organizational
goals, then you're focussing more on the output rather than outcome.
