content/posts/2021-book-review-accelerate-the-science-of-lean-software-and-devops.md


### Software Delivery Performance {#software-delivery-performance}

Since it should be clear by now that the faster you are able to deliver your software to
your customers, the more you're confident you're doing the right things, the book defines
4 criterias for software delivery performance:

-   **Delivery Lead Time**
    -   you would usually measure
        -   time to design and validate customer request
        -   time to deliver feature to customer
-   **Deployment frequency**
    -   the work load here is very important
    -   you should slice you work in small batches that can be completed in a short time period (a week or even less)
    -   decompose your work into small features
        -   this will allow rapid development
        -   you should be able to deploy more frequently
    -   use **MVPs** to first validate the requirements and to incorporate customer feedback
        -   this way to can create value very quickly
        -   you can still have **clean code** and all the things **after** you're sure you're building the right thing
-   **Mean Time to Restore** (MTTR)
    -   the average time to restore services
-   **Change fail percentage**
    -   this failure rate measures how often deployment failures occur in production that require immediate attention and remediation (e.g. rollbacks)
    -   this also applies to infrastructure configuration changes


### How fast is fast? {#how-fast-is-fast}

After presenting the criterias, let's have a look at some raw numbers.

<div class="table-caption">
  <span class="table-number">Table 1</span>:
  Software Delivery Performance in 2017
</div>

| 2017                 | High Performers                    | Medium Performers                        | Low Performers                                 |
|----------------------|------------------------------------|------------------------------------------|------------------------------------------------|
| Deployment Frequency | on demand (multiple times per day) | Between once per week and once per month | Between once per month and once every 6 months |
| Delivery Lead Time   | < 1 hour                           | Between one week and one month           | Between one month and 6 months                 |
| MTTR                 | < 1 hour                           | < 1 day                                  | < 1 day                                        |
| Change fail rate     | 0-15%                              | 0-15%                                    | 31-45%                                         |

As you can see high-performers have a quite high deployment frequency and most important
the delivery lead time is extremely fast.


## How to accelerate {#how-to-accelerate}

Now that you knwo the key metrics when it comes to **software delivery performance** how do
you actually _accelerate_ and start changing your organization? Of course you can

-   change the **culture** within you deliver value
-   improve on a **technical** level
-   have an effective **architecture**
-   invest in a strong **leadership**

Let's dissect each one piece by piece.


### Change culture {#change-culture}

In order to understand which changes are good for your organizations, sociologist _Ron
Westrum_ has defined a model on importance of **organizational culture**. Before he was
researching on human factors in system saftey, especially in the context of accidents in
technological domains that were highly complex and risky (aviation and healthcare). From
his point of view organization culture is vital because it defines how **information flows
through an organization**. He defines following types of organizations:


#### Orgnization types {#orgnization-types}

-   **pathological (power-oriented)**
    -   characterized by large amounts of fear and threat
    -   information is not made transparent and/or is withhold for political reasons
-   **Bureaucratic (rule-oriented)**
    -   protect departments
    -   those in the department want to maintain their turf (area)
    -   insist on their own rules
    -   do things by their book
-   **Generative (performance-oriented)**
    -   focus on the mission
    -   everything is focused on good performance, to doing what is supposed to do

In Westrum's theory **information flow** within an organization has a **huge impact** on its performance:

-   good culture requires **trust** and **cooperation** between people across the organization
    -   it also maps the way how team collaborate in the company
-   having a good organization culture can have an impact on the quality of **decision-making**
    -   if information is made transparent and available, taking decisions is way easier
    -   you can also reverse the decisions if they turn out to be wrong
        -   no blame game
        -   seek for trial and error
-   teams within thise open environment are more likely to do a batter job, since problems and conflicts are rapidly discovered and addressed

{{< notice info >}}
You can read more about Westrum's organizational culture on [Google's DevOps guide](https://cloud.google.com/architecture/devops/devops-culture-westrum-organizational-culture).
{{< /notice >}}


### Change technical practices {#change-technical-practices}

Among the software and tools you use within your team, there is one _capability_ that seems
to have a big impact on your overall performance: **Continuous Delivery**.
