content/posts/2021-book-review-accelerate-the-science-of-lean-software-and-devops.md


#### Continuous Delivery {#continuous-delivery}

_Continuous Delivery_ is a set of capabilities to enable changes of all kinds (features, configuration changes, bug fixes, experiments) go into production "safely", "quickly" and "suistanably". There are some _principles_:

-   **Build quality in**
    -   Eliminate the need for mass inspection by building quality into the product in the first place
    -   invest a culture supported by tools and people where issues can be detected quickly
    -   issues should be fixed straight away when they're cheap to detect and resolve
-   **Work in small batches**
    -   split work in smaller chunks that deliver measurable business outcomes on a small part of the market
    -   through feedback the course can be corrected
    -   also a key goal is to change the economics of the software delivery process in order to minimize the cost of cost of changes
-   **Computers perform repetitive tasks, people solve problems**
    -   take long repetitive work (testing, deployments) and invest in simplyfing and automating this work
    -   this way "people" have more time for problem-solving work
-   **Relentlessly pursue continuous improvement**
    -   high-performers are never satisfied
    -   they make improvement part of their daily work and culture
-   **Everyone is responsible**
    -   everyone involved in the software delivery process has to work together

In order to implement **CD** following **foundations** should be created:

-   Comprehensive configuration management
    -   build, test and deploy software fully in an automated manner from information stored in a version control system
    -   any changes should be applied in the version control
-   [Continuous Integration (CI)](https://brainfck.org/#Continuous%20Integration%20(CI))
-   [ Continuous Testing](https://brainfck.org/#Continuous%20Testing)

During their research the authors have identified following **key drivers** for continuous delivery:

-   **Version Control**
    -   I guess this one is indisputable
-   **Deployment Automation**
-   **Continuous Integration**
    -   use Trunk-Based development
    -   each change triggers a build process (incl. running test suites)
    -   if any part of the process fails, developers should be notified immediately
-   **Trunk-Based Development**
    -   don't use long-lived feature branches; keep them short
    -   merge with trunk/master as soon as possible
    -   deploy changes into production as fast as possible
-   **Continuous Testing**
    -   tests should run as a vital part of the development process
    -   automated unit tests and acceptance tests should run against every change in VC (version control) in order to give developers immediate feedback on their changes
    -   also check [Software Testing](https://brainfck.org/#Software%20Testing)
-   **Test Data Management**
    -   when dealing with automated tests, managing test data can be challenging
    -   high-performers use to have proper test data for the testing
-   **Shift Left on Security**
    -   this is a broad topic and it's basically about the idea that you apply Security measures very early in the development process
    -   you could do consultancy work and help developers to implement new features with a hacker mindset
    -   you could apply automated Security testing as part of your tests suite
-   **Loosely Coupled Architecture**
    -   software architecture can become a significant barrier when you want to increase the stability of the release process and the speed you deliver new features
    -   architectural decisions and constraints do have an impact on delivery performance
    -   an effective architecture should enable teams to easily test and deploy **individual** components/services even if the organization or the number of systems it owns/operates grow
    -   this should allow productivity to increase while having scalability


### Change architecture {#change-architecture}

As I've mentioned previously a **loosely coupled architecture** enabled high-performers to better build and maintain systems. No matter what kind of systems you are building
there should be little communication required between delivery teams in order to get work done. Futhermore the architecture of your systems should _enable_ teams to test, deploy and change systems without depending on other teams. Communication channels should not be ignored completely. However, they should be used for discussing high-level _shared_ goals and how to achieve/implement them. Fine-grained decision-making on a technical level should only take place within the teams - unless you are required to
discuss technical stuff with other members as well. Also important: **Let the teams chose tools and technologies**. (Good software) architects should focus on concepts, engineers and outcomes, not on technical discussion and concrete tools/technologies.

{{< notice info >}}
Also check out my bookmarks and notes on [architecture](https://brainfck.org/#Architecture). I also recommend reading [The Clean Architecture](https://brainfck.org/#The%20Clean%20Architecture) and [The Clean Code](https://brainfck.org/#The%20Clean%20Code).
{{< /notice >}}


### Change product management {#change-product-management}

If you've noticed already, the book title mentions _The Science of Lean Software and DevOps_. While most of you probably know what **DevOps** is about, what is **Lean Software**?
The term itself (_Lean_) derives from _Lean Management_ and used to be Toyota's approach to car (manufacturing):

-   originally designed to solve the problem of creating a wide variety of different types of cars for the Japanese market
-   this enabled Toyota to build cars faster, cheaper and with higher quality than the competition
-   the US manufacturing industry only survived by adopting these ideas and methods

How can these methods be applied to software engineering? Well, let's have a look at some characteristics:

-   **Limit work in progress**
    -   work in small batches (as mentioned previously)
    -   the idea is to have work decomposed into features that allow rapid development, instead of complex features developed on (feature) branches and deployed infrequently
    -   merge with trunk/master as fast as possible
-   **Visual management**
    -   create and maintain visual displays to show key quality and productivity metrics and the current status of work (also problems)
    -   make these displays available to both engineers and leaders
    -   align these goals with operational goals
-   **Feedback from production**
    -   Use data from application performance and infrastructure monitoring tools to make business relevant decisions on a daily basis
-   **Lightweight change approvals**
    -   have a easy-to-follow change management process
    -   teams should be allowed to try out new ideas, create and update requirements during development process without any approval of people outside the team
    -   no time intensive approvals by external entities (boards, managers etc.)


### Make people happy {#make-people-happy}

While technical practices have an impact on the ability to deliver software quickly, they can also help to reduce stress and anxiety related to the fear of breaking something.
When people are not confident that their changes will break anything in production, their productivity and motivation decline. In order to reduce deployment pain and reduce the risk of a burnout, the authors recommend to:

-   design and build systems to be deployed easily into multiple environments
    -   failures can be asily detected and mitigated
    -   various components of the systems can be updated independently
-   make sure that state of production systems can be reproduced in an automated manner from version control
-   design and implement the deployment process as simple as possible
