content/posts/2021-book-review-accelerate-the-science-of-lean-software-and-devops.md


### Have strong leadership {#have-strong-leadership}

While _leader != manager_, leadership should be about inspiring and motivating people surrounding you. Even more: A **transformational leadership** should affects a team's
ability to:

-   deliver code
-   architect good systems
-   apply _Lean Software_ development pratices (as descrived before)

These are the characterstics of a good transformational leader (Rafferty and Griffin 2004):

-   **vision**
    -   has clear understanding where the currently the org is and where it should be in the next 5 years
-   **inspirational communication**
    -   inspires and motivates, even in an uncertain or changing environment
-   **intellectual stimulation**
    -   challenges followers to think about problems in new ways
-   **Supportive leadership**
    -   demonstrates care and consideration
-   **Personal recognition**
    -   praises and acknowledges achievement of goals/improvements in work quality


## Conclusion {#conclusion}

DevOps and Agile are already used by many organizations as part of their transformation strategy. They encourage a culture of transparency, shared responsability, faster feedback
and automization. [Accelerate](https://brainfck.org/#Accelerate) is the scientific, data-driven approach to put all pieces together, to show you how they depend on each other and finally achieve a better organizational performance.  And while software is at the heart of most modern companies it is essential to have a solid, stable and secure software delivery process.

For me this book was definitely one the most influencial ones I've read in the past years.
You might also check out [other books by
Gene Kim](https://itrevolution.com/faculty/gene-kimother) (he is one of the authors) if you're interested in DevOps, Agile transformation
and successful user stories. Beside that I also recommend the
[Google SRE books](https://sre.google/books/).
